{
  "blogs": [
    {
      "title": "Web development",
      "body": "Web developers create and maintain websites. They are also responsible for the site's technical aspects, such as its performance and capacity, which are measures of a website's speed and how much traffic the site can handle. In addition, web developers may create content for the site.",
      "author": "Leap Chanvuthy",
      "id": 1
    },
    {
      "title": "Mobile development",
      "body": "Mobile developers specialise in developing software for Android and iOS mobile devices. Mobile developers focus on developing apps for mobile devices. They're also known as Android or iOS developers if they work on one platform, but it's common for developers to work on both.",
      "author": "The Net Ninja",
      "id": 2
    },
    {
      "title": "FullStacks developement",
      "body": "A full-stack developer is a developer or engineer who can build both the front end and the back end of a website. The front end (the parts of a website a user sees and interacts with) and the back end (the behind-the-scenes data storage and processing) require different skill sets.",
      "author": "Jame Cooper",
      "id": 3
    },
    {
      "title": "What is GitHub and why it is used?",
      "body": "GitHub is a web-based version control and collaboration platform for software developers. Microsoft, the biggest single contributor to GitHub, acquired the platform for $7.5 billion in 2018. GitHub, which is delivered through a software as a service (SaaS) business model, was started in 2008. It was founded on Git, an open source code management system created by Linus Torvalds to make software builds faster.\n\nGit is used to store the source code for a project and track the complete history of all changes to that code. It lets developers collaborate on a project more effectively by providing tools for managing possibly conflicting changes from multiple developers.",
      "author": "vuthy",
      "id": 4
    },
    {
      "title": "This is leap chanvuthy blog",
      "body": "This is leap chanvuthy blog in 2023",
      "author": "",
      "id": 5
    }
  ]
}